Examinator/src/Catalogs/СтраницыЭлементовЭлектронныхКурсов/СтраницыЭлементовЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтраницыЭлементовЭлектронныхКурсов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ЭлектронныеТесты</owners>
  <owners>Catalog.ТеорияЭлектронныхКурсов</owners>
  <attributes>
    <name>СсылкаНаЭлементКурса</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
      <types>CatalogRef.ТестовыеВопросы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <comment>Item / parameters</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/СтраницыЭлементовЭлектронныхКурсов/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ДобавитьСтраницу(ТеорияИлиТест, ЭлементСтраницы, ГруппаСтраниц) Экспорт
	
	ЭлементПодборкиОбъект = Справочники.СтраницыЭлементовЭлектронныхКурсов.СоздатьЭлемент();
		                                    
	ЭлементПодборкиОбъект.Наименование         = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСтраницы, "Наименование");
	ЭлементПодборкиОбъект.Владелец             = ТеорияИлиТест;
	ЭлементПодборкиОбъект.СсылкаНаЭлементКурса = ЭлементСтраницы; 
		
	Если ЗначениеЗаполнено(ГруппаСтраниц) Тогда
		
		ДанныеГруппыЭлементаПодборки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГруппаСтраниц, "ЭтоГруппа, Родитель");
		
		Если ДанныеГруппыЭлементаПодборки.ЭтоГруппа Тогда
			ЭлементПодборкиОбъект.Родитель = ГруппаСтраниц;
		Иначе
			ЭлементПодборкиОбъект.Родитель = ДанныеГруппыЭлементаПодборки.Родитель;
		КонецЕсли;
		
	КонецЕсли;
	
	РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(ЭлементПодборкиОбъект);
	
	ЭлементПодборкиОбъект.Записать();
	
	Возврат ЭлементПодборкиОбъект.Ссылка;	
	
КонецФункции

Функция ЭлементЕдинственнойСтраницы(ТеорияИлиТест) Экспорт
	
	ЕдинственныйЭлемент = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраницыЭлементов.СсылкаНаЭлементКурса КАК СсылкаНаЭлементКурса
		|ИЗ
		|	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыЭлементов
		|ГДЕ
		|	СтраницыЭлементов.ПометкаУдаления = ЛОЖЬ
		|	И СтраницыЭлементов.Владелец = &ПодборкаЭлементов
		|	И СтраницыЭлементов.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПодборкаЭлементов", ТеорияИлиТест);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда			
			ВыборкаДетальныеЗаписи.Следующий();	
			ЕдинственныйЭлемент = ВыборкаДетальныеЗаписи.СсылкаНаЭлементКурса;
		КонецЕсли;

	КонецЕсли;
	
	Возврат ЕдинственныйЭлемент;	
		
КонецФункции

Процедура Перезаписать(ЭлементПодборки, ВесВопроса = Неопределено) Экспорт

	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.СтраницыЭлементовЭлектронныхКурсов");
	ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ЭлементПодборки);
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаДанных.Заблокировать();	
	
	ОбъектЭлементПодборки =  ЭлементПодборки.ПолучитьОбъект();
	
	Если ВесВопроса <> Неопределено Тогда
		ОбъектЭлементПодборки.ВесВопроса = ВесВопроса;
	КонецЕсли;
	
	// Наименование будет обновлено в обработчике ПередЗаписью модуля объекта
	ОбъектЭлементПодборки.Записать();
			
КонецПроцедуры

// Позволяет получить таблицу групп элементов верхнего уровня подборки.
//
Функция СтраницыВладельца(Владелец) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СтраницыЭлементовЭлектронныхКурсов.Ссылка,
	|	СтраницыЭлементовЭлектронныхКурсов.ЭтоГруппа,
	|	СтраницыЭлементовЭлектронныхКурсов.СсылкаНаЭлементКурса,
	|	СтраницыЭлементовЭлектронныхКурсов.Наименование
	|ИЗ
	|	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыЭлементовЭлектронныхКурсов
	|ГДЕ
	|	СтраницыЭлементовЭлектронныхКурсов.Владелец = &Владелец
	|	И СтраницыЭлементовЭлектронныхКурсов.Родитель = &Родитель
	|	И СтраницыЭлементовЭлектронныхКурсов.ПометкаУдаления = &ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтраницыЭлементовЭлектронныхКурсов.Код");
	
	
	Запрос.УстановитьПараметр("Владелец", Владелец); 
	Запрос.УстановитьПараметр("Родитель", Справочники.СтраницыЭлементовЭлектронныхКурсов.ПустаяСсылка()); 
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь); 
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

// Позволяет получить все элементы группы и все элементы вложенных подгрупп.
// Ссылки на сами группы не выводит, только элементы.
//
// Параметры
//  Группа - Ссылка на элемент справочника ЭлементыПодборкиСУЗ.
//
// Возвращаемое значение:
//   Таблица - содержит ссылки на найденные элементы заданной группы.
//
Функция ВсеЭлементы(Подборка, Группа = Неопределено, ТипЭлемента = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтраницыЭлементовЭлектронныхКурсов.Ссылка КАК Ссылка,
	               |	СтраницыЭлементовЭлектронныхКурсов.СсылкаНаЭлементКурса КАК СсылкаНаЭлементКурса,
	               |	СтраницыЭлементовЭлектронныхКурсов.ВесВопроса КАК ВесВопроса,
	               |	СтраницыЭлементовЭлектронныхКурсов.Родитель КАК Родитель,
	               |	СтраницыЭлементовЭлектронныхКурсов.ПараметрыЗапуска КАК ПараметрыЗапуска
	               |ИЗ
	               |	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыЭлементовЭлектронныхКурсов
	               |ГДЕ
	               |	СтраницыЭлементовЭлектронныхКурсов.Владелец = &Подборка
	               |	И СтраницыЭлементовЭлектронныхКурсов.ПометкаУдаления = ЛОЖЬ
	               |	И СтраницыЭлементовЭлектронныхКурсов.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Подборка", Подборка);
	
	Если ЗначениеЗаполнено(Группа) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		| И	СтраницыЭлементовЭлектронныхКурсов.Родитель В ИЕРАРХИИ(&Группа)";
		
		Запрос.УстановитьПараметр("Группа", Группа);
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ТипЭлемента) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		| И	ТИПЗНАЧЕНИЯ(СтраницыЭлементовЭлектронныхКурсов.СсылкаНаЭлементКурса) = &ТипЭлемента";
		
		Запрос.УстановитьПараметр("ТипЭлемента", ТипЭлемента);
		
	КонецЕсли;
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция НайтиПоСсылкеНаЭлемент(СсылкаНаЭлемент, Подборка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраницыЭлементовЭлектронныхКурсов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыЭлементовЭлектронныхКурсов
		|ГДЕ
		|	&ОтборПоВладельцу
		|	И СтраницыЭлементовЭлектронныхКурсов.СсылкаНаЭлементКурса = &СсылкаНаЭлементКурса
		|	И СтраницыЭлементовЭлектронныхКурсов.ЭтоГруппа = ЛОЖЬ
		|	И СтраницыЭлементовЭлектронныхКурсов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("СсылкаНаЭлементКурса", СсылкаНаЭлемент);
	
	Если Подборка = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВладельцу", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВладельцу", "СтраницыЭлементовЭлектронныхКурсов.Владелец = &Подборка");
		Запрос.УстановитьПараметр("Подборка", Подборка);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Страница = Неопределено;
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда					
		ВыборкаДетальныеЗаписи.Следующий();
		Страница = ВыборкаДетальныеЗаписи.Ссылка;						
	КонецЕсли;
	
	Возврат Страница;
	
КонецФункции

#КонецОбласти

#КонецЕсли
